# data-database-types-relational-language-SQL-MySQL-C_R_UD-read-command-SELECT-ORDER-BY
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **return** **information** **sorted** in a **particular** **order** - must explicitly tell - mysql - of this order [1]

[MySQL Documentation](https://web.archive.org/web/20200617065035/https://dev.mysql.com/doc/refman/8.0/en/order-by-optimization.html)

```sql
mysql> use lab1;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab1 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

- **table** - entity - relation - person - **appears** to be **ordered** by column - attribute - field - personID - ordered **by** the **way** the **rows** - records - tuples - **were** **added** to the table - entity - relation - albeit this is not always guaranteed [1]

- **dependent** on **internal** way - **mysql** - **stores** the **physical** **tables** - entities - relations - is **possible** statement - **SELECT** * - **all** - could **return** **rows** - records - tuples - in **any** **order** - determined by - physical storage - order returned is never guaranteed [1]

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

- returned rows - records - tuples - on all columns - attributes - fields - **clause** - **ORDER** **BY** - **column** - attribute - field - name - **value** in **alphabetical** **order** - optional - keyword - ASC - **ascending** order - **default** [1]

```sql
mysql> SELECT *
    -> FROM person
    -> ORDER BY name;
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

- returned rows - records - tuples - all columns - attributes - fields - **clause** - **ORDER** **BY** - **column** - attribute - field - name - **value** sorted in **reverse** **alphabetical** **order** - **keyword** - **DESC** - data type - varchar - a string - sort in descending order - if numeric - largest to smallest [1]

```sql
mysql> describe person;
+-----------+---------------+------+-----+---------+----------------+
| Field     | Type          | Null | Key | Default | Extra          |
+-----------+---------------+------+-----+---------+----------------+
| personID  | int           | NO   | PRI | NULL    | auto_increment |
| name      | varchar(20)   | NO   |     | NULL    |                |
| age       | int           | YES  |     | NULL    |                |
| sex       | enum('M','F') | YES  |     | M       |                |
| dob       | date          | YES  |     | NULL    |                |
| isStudent | tinyint(1)    | YES  |     | NULL    |                |
+-----------+---------------+------+-----+---------+----------------+
6 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person
    -> ORDER BY name DESC;
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

- returned - amendment - **column** - attribute - field - dob - sorted by year of birth - **function** - **YEAR** - **parameter** - **date** **type** - **obtains** **year** from date - original order now ordered by date of birth - default ascending - function - **MONTH** - **obtain** **month** from date - function - **DAY** - obtain **day** from **date** [1]

```sql
mysql> SELECT *
    -> FROM person
    -> ORDER BY name DESC,YEAR(dob);
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

***
# END